
interface IDList {
  name: string
  url: string
  ids: number[]
}

const nextCamp: IDList = {
  name: 'ネクストキャンプ',
  url: 'https://www.ipa.go.jp/files/000091508.pdf',
  ids: [13, 16, 19, 25, 27, 29, 30, 33, 34, 35]
}

const secCamp: IDList = {
  name: '全国大会',
  url: 'https://www.ipa.go.jp/files/000091507.pdf',
  ids: [
    134, 184, 313, 412, 452,
    112, 125, 130, 175, 241, 299, 302, 306, 312, 316, 379,
    106, 126, 132, 135, 156, 243, 259, 274, 279, 333, 369,
    145, 169, 177, 248, 251, 276, 307, 351, 363, 374, 392, 427, 435,
    198, 330, 456,
    139, 170, 250, 278,
    371,
    271, 420,
    191, 247, 268, 334, 380,
    101, 253, 258, 365, 376,
    144, 187, 214, 331, 387, 393,
    269, 343,
    408, 438,
    211, 224, 232, 249,
    356, 357,
    386,
    242, 370, 397,
    194, 225, 254, 256,
  ]
}

const idLists = [nextCamp, secCamp];

export { idLists }